{
  "query": "Adil Keku Gazder",
  "rendered_query": "\"Adil Keku Gazder\"",
  "total_results": 3,
  "texts": [
    "ag826 (Adil Keku Gazder) · GitHub Skip to content You signed in with another tab or window. Reload to refresh your session. You signed out in another tab or window. Reload to refresh your session. You switched accounts on another tab or window. Reload to refresh your session. Dismiss alert ag826 Follow More Overview Repositories Projects Packages Stars ag826 Follow Adil Keku Gazder ag826 Follow Passionate about bringing multidisciplinary perspectives with data-driven approaches to tackle the biggest problems of today and create impact ground up. 3 followers · 0 following Durham, North Carolina 04:47 (UTC -05:00) LinkedIn in/adilgazder Achievements Achievements Block or Report Block or report ag826 Block user Prevent this user from interacting with your repositories and sending you notifications.\n          Learn more about blocking users . You must be logged in to block users. Add an optional note Maximum 250 characters. Please don't include any personal information such as legal names or email addresses. Markdown supported. This note will be visible to only you. Block user Report abuse Contact GitHub support about this user’s behavior.\n        Learn more about reporting abuse . Report abuse More Overview Repositories Projects Packages Stars ag826 / README .md Adil Keku Gazder (@ag826) As a Data Science graduate student at Duke University (Class of '26), I am passionate about bringing multidisciplinary perspectives and data-driven approaches to solving today’s biggest challenges and creating impactful solutions from the ground up. My diverse experiences span various domains, including recent work in Healthcare focusing on Oncology analytics (Lung Cancer and DLBCL), following a successful stint in the Logistics industry where I specialized in Growth Strategy and Diversification. I strongly believe in the power of collaboration and love understanding how we can apply advanced computing techniques, theories, and algorithms in our everyday lives. I completed my Bachelor's degree from Shiv Nadar University in Mechanical Engineering with a specialization in Materials Sciences (focusing on Nanostructured Functionalized Surfaces) and a minor from the Department of Computer Science and Engineering. Beyond academics and professional work, I'm also a Podcast Host, an Emcee, an Investor, a Researcher, and a two-time All-India level Double Gold Medalist in Taekwondo. Skills 💻 Languages: C, Java, Python(Pandas, NumPy, PySpark, Matplotlib), SQL, RUST, R 🛠 Softwares: AWS (S3, Athena, Redshift, EMR), MS Office (Excel, Powerpoint), Databricks, Tableau 🎓 Certifications: Advanced Data Analytics (Google), Advanced SQL (Kaggle), Intermediate Machine Learning (Kaggle) The Journey Here Impact Delivered Analysed and forecasted treatment patterns for 19K+ oncologists in the US lymphoma market, applying predictive modelling techniques to forecast market trends. Drove commercial strategy decisions in the lung cancer market using comprehensive patient journey mapping; created analytics pipelines and dashboards managing 279K+ cancer patients. Utilized advanced clustering techniques to segment doctors, demonstrating the ability to identify usage patterns and tailor marketing and engagement strategies for each segment. Conducted comprehensive market research, analysing patient charts and responses to deliver actionable insights into the current leukaemia treatment landscape and preferences. Designed Go-to-Market (GTM) strategies for and subsequently led the Direct to Consumer (DTC) pilot project to redesign, digitize and optimize the delivery network model. Provided solutions to optimize daily operations by creating dashboards analysing key performance metrics, resulting in minimized human intervention and error. Additionally optimized client brand distribution and restock strategies, resulting in minimized Return to Vendor (RTV) orders by 18%. Directed a team of 3 in conducting market research for various diversification opportunities in the Retail and HoReCa markets in India and abroad. Reviewed various avenues and successfully raised seed funding from a prominent sector-agnostic fund pool. Received additional non-monetary grants from Startup India and on being ranked within the Top 100Startups in Maharashtra (MSINS, 2021). Elected as Secretary of External Affairs (Student Council - 2020) and facilitated an 83% increase in external participation with students representing the university on 50+ different occasions. Signed 3 MOUs with various organizations to promote cultural and technical growth within the university. Co-Founded and led the Martial Arts Society as the primary instructor for 2 years, conducting 100+ sessions for 60+ students and faculty members. Hosted multiple seminars while training the cohort for national-level competitions, earning recognition and accolades from senior leadership of the university. Passion Areas 🌄 Adventure: Exploring the path not taken. River rafting, paragliding, rock climbing 🏊‍♂️ Fitness: Swimmer, cyclist, weightlifter and black belt martialist 📽 Entertainment: Formula 1, audiobooks and TV shows! Lets connect! Pinned Loading IDS_789_Portfolio_Design IDS_789_Portfolio_Design Public Forked from visheshgupta19/IDS_789_Final_Project Developed an investment portfolio optimization algorithm that outperformed the S&P 500 by 18% with lower volatility while maintaining diversification through algorithmic constraints. Jupyter Notebook IDS706_career_laucher IDS706_career_laucher Public Forked from nogibjj/IDS706_final_project_mady Designed an AWS-based platform to parse resumes and analyze skill demand, leveraging NLP (LDA, Gemini) to uncover industry trends and historical job market insights in the U.S. Python IDS702_ecological_modeling IDS702_ecological_modeling Public Analyzing the role of education, income, and socioeconomic factors in shaping global carbon emissions (2015-2023) through regression models to uncover insights for sustainable development and clima… Mech-repo Mech-repo Public An overview of some of my research work as part of my undergraduate degree in Mechanical Engineering Something went wrong, please refresh the page to try again. If the problem persists, check the GitHub status page or contact support . Uh oh! There was an error while loading. Please reload this page . You can’t perform that action at this time.",
    "✰ LIVE AI Ivy Plus 2025: The premier accelerator-backed hackathon program. A fresh and excellent multi-campus hybrid event hosted @Duke @Harvard @Online - Devpost Connect with the participants – support your favorite projects\n              by liking, sharing, and commenting on them. Select one Name Recent Sort NeoNest: The Magic Mirror that Brings Learning to Life NeoNest is an AI-powered magic mirror with Neo, a 3D chicken chatbot that teaches kids through movement tracking, real-time animations, and interactive text, making learning fun and memorable. buy4me? Ask friends to pick things up when they’re near a store. Auto-detects purchases via Plaid, uses AI to match transactions with requests, handles Venmo requests—turning errands into effortless favors. Lendora Revolutionizing secondary lending with blockchain: tokenized loans, instant verification, and fractionalized ownership—making investing in loans as seamless as shopping online. Eventopia Your smart event planner that personalizes recommendations, optimizes itineraries within your budget and time constraints, curating experiences using your internet browsing history (with consent)! MambaMentor Messaging service integration that elevates your charisma by providing real-time, conversational suggestions. Kaldi AI Realtime UI updates with voice commands , making food ordering hassle free EasyA Smart assignments for teachers! Instant clarity for students! SignFlow: Live ASL Interpretation & Learning Convert speech to ASL with 3D signing and display a virtual ASL interpreter using a virtual camera for seamless online meetings. Practice fingerspelling with real-time ASL alphabet recognition. TurkEye TurkEye is a Chrome extension that blocks AI-generated deepfakes, explicit content, and fake news. Horizon - Loan against Crypto Unlock the power of your crypto: access liquidity without selling your assets. GluDaily Gludaily connects to CGMs for real-time glucose tracking, AI-powered meal recommendations, and glucose impact predictions, helping diabetics make smarter food choices and stay in control effortlessly. Ticketchain A ticket selling platform powered by Blockchain. Say goodbye to fraud and scalpers, and enjoy secure, fair, transparent and hassle free event tickets with NFTs. InsureMe Inclusive Insurance, Smarter Investments Roko Compute is critical as LLMs become larger. Meanwhile, laptops (like M3/M4s) Apple sell millions /year, and are as powerful as gpus. We allow users to offer their laptops for llms, earning crypto. NovaScore AI-powered credit building and decentralized lending for those with little or no credit history. Project Pi People with many goals often struggle to manage their time and measure their growth long-term. [Project Pipeline] aims bring more clarity to everyone navigating the labor-skills market today. EVOlution We are a peer-to-peer system for selling anyone compute for running AI models, anonymously and securely based on the number of teraflops they provide users who want to use the model. Incubator.Ai Productivity Ai software for entrepreneurs to guide then into their new journey Sankalp AR Sankalp AR is based on to solve the real life solutions by the mythological stories by immersively with the Augmented Reality MedClaimVerify Tired of tedious claim forms and frustrating errors? Our AI-powered platform helps you get to an approval-ready claim—just upload your documents, and we take care of the rest. Recovery assistant AI bot to help you recover faster Memoir: A Second brain In today’s fast-paced world, we consume endless information—but how much do we actually retain? Memoir organizes your knowledge intelligently, making it easy to recall and use when it matters most. wormciv play as a mad bioengineer and usher in the dawning of worm civilization EDUCATE Educate is an AI-powered platform where students can learn, build communities, participate in hackathons, and secure jobs—all in one place, with tailored support for every student's unique needs. 1 – 24 of 46 « 1 2 »",
    "The Agentic Rolodex | Devpost Inspiration Networking is crucial for professional growth, but keeping track of connections, meaningful interactions, and relevant insights is time-consuming. We wanted to create a smart, AI-powered tool that makes relationship management effortless. What it does The Agentic Rolodex organizes your professional contacts, tracks interactions, aggregates public information, and provides actionable insights to strengthen relationships and grow your network efficiently—essentially a modern, intelligent Rolodex. How we built it We leveraged AI and NLP to analyze contact data, detect meaningful interactions, and summarize insights. The system automatically pulls public information, organizes it into a clean interface, and highlights opportunities to engage strategically. Challenges we ran into We faced difficulties in accurately aggregating public data without duplication, ensuring privacy compliance, and designing an intuitive interface that balances automation with user control. Accomplishments that we're proud of We successfully built a functional prototype that can analyze and summarize interactions, deliver actionable insights, and provide users with a clear, organized view of their professional network. What we learned We gained experience in integrating AI for practical, relationship-driven use cases, handling data aggregation challenges, and translating complex analytics into actionable recommendations. What's next for The Agentic Rolodex We plan to expand integrations with communication platforms, improve personalization of insights, and explore predictive analytics to suggest proactive networking opportunities before they arise. Built With python Like Share this project: Updates Adil Keku Gazder started this project — Nov 08, 2025 04:35 PM EST Leave feedback in the comments! Log in or sign up for Devpost to join the conversation."
  ],
  "links": [
    "https://github.com/ag826",
    "https://liveai-ivyplus-2025.devpost.com/project-gallery",
    "https://devpost.com/software/the-agentic-rolodex"
  ]
}