{
  "query": "Pranshul Bhatnagar",
  "rendered_query": "\"Pranshul Bhatnagar\"",
  "total_results": 10,
  "texts": [
    "",
    "Pranshul Bhatnagar - Duke MIDS Pranshul Bhatnagar Graduation year : 2027 LinkedIn",
    "Error fetching content: 403 Client Error: Forbidden for url: https://www.sciencedirect.com/science/article/abs/pii/S1359511324002137",
    "People - Duke MIDS People Clarissa Ache Cabello Class of 2023 Dapo Adegbile Class of 2022 Günel Aghakishiyeva Class of 2025 Osama Ahmed Class of 2025 Lorna Maria Aine Class of 2024 Kashaf Ali Class of 2024 Abdullah Alothman Class of 2021 Guillem Amat Class of 2021 Mohammad Anas Class of 2023 Jordan Andrew Class of 2027 Abhishek Basavaraj Angadi Class of 2020 Godwin Anguzu Class of 2023 Susanna Anil Class of 2024 Ailina Aniwan Class of 2026 Tyler Ashoff Class of 2020 Skye Augsorn Class of 2026 Michael Kofi Badu Class of 2027 Kian Bagherlee Class of 2025 Poojitha Balamurugan Class of 2025 Yunhong Bao Abhishek Baral Class of 2021 Ravitashaw Bathla Class of 2021 Anna Eleanor Berman Class of 2020 Himangshu raj Bhantana Class of 2023 Nikhil Bhargava Class of 2022 Pranshul Bhatnagar Class of 2027 Arko Bhattacharya Class of 2026 Antara Bhide Class of 2025 Dauren Bizhanov Class of 2023 Angelica Blanks Pratt School of Engineering Master’s Programs Jana Schaich Borg Social Science Research Institute Kyle Bradbury Electrical and Computer Engineering Felipe Buchbinder Class of 2021 Nathan Bush Class of 2026 Yuheng “Shelly” Cao Class of 2027 Joao Capanema Mansur Class of 2021 Caleb Carlyle Class of 2027 Nick Carroll Class of 2024 Javier Cervantes Buch Class of 2025 Zisheng (Jason) Chang Class of 2020 Cheng-Pang (Tego) Chang Class of 2023 Yiran (Becky) Chen Class of 2021 Elisa Yuning Chen Class of 2024 Xiaoyu (Echo) Chen Class of 2024 Jenny Chen Class of 2026 Sizhe Chen Class of 2026 Leo Chen Class of 2026 Bojun “Bruce” Chen Class of 2027 Yuting (Cindy) Chiu Class of 2023 Nruta Choudhari Class of 2026 Revanth Chowdary Ganga Class of 2025 John Coogan Class of 2025 Kate Coulter Class of 2020 Massimo Cutuli MIDS Anna Dai Class of 2023 Medhavi Darshan Sarwari Das Class of 2023 Rafael Davila Bugarin Class of 2025 Peter de Guzman Class of 2026 Aarya Desai Class of 2025 Nakiyah Dhariwala Class of 2026 Muxin (Yolanda) Diao Class of 2020 Sydney Donati-Leach Class of 2023 Zhiwei (Calvin) Dong Class of 2021 Beibei Du Class of 2024 Meixiang Du Class of 2025 Hongyi Duan Class of 2026 Lilah DuBoff Class of 2026 Leonard Eshun Class of 2026 Nick Eubank Political Science Oge Ezenwa Class of 2027 Yi Feng Class of 2022 Yuan Feng Class of 2021 Ying Feng Class of 2023 Matthew Fischer Class of 2027 Brian Fitzpatrick Mathematics Bárbara Flores Ríos Class of 2025 Erika Fox Class of 2023 Malcolm Fraser Class of 2022 Adriane Fresh Social Science Research Institute Yingyu Fu Class of 2021 Aesha Gandhi Class of 2027 Jiaxin (Cindy) Gao Class of 2026 Adil Gazder Class of 2026 Meron Gedrago Class of 2026 Pinaki Ghosh Class of 2027 Astrid Giugni Social Science Research Institute Han Gong Class of 2022 Junbo Guan Class of 2022 Maobin Guo Class of 2022 Ishan Gupta Class of 2021 Avani Gupta Class of 2020 Ayush Gupta Class of 2025 Vishesh Gupta Class of 2026 Kayla Haeussler Class of 2026 Aiman Jawaid (Aiman) Haider Class of 2022 Marlyne Hakizimana Class of 2023 Lingyue Hao Class of 2027 Mobasser Haque Class of 2026 Tigran Harutyunyan Class of 2023 Showing 1-100 of 365 results Load More",
    "Molten salts: Potential candidates for thermal energy storage applications - Bhatnagar - 2022 - International Journal of Energy Research - Wiley Online Library International Journal of Energy Research Volume 46, Issue 13 pp. 17755-17785 REVIEW PAPER Full Access Molten salts: Potential candidates for thermal energy storage applications Pranshul Bhatnagar , Pranshul Bhatnagar Department of Chemical Engineering, BITS Pilani Hyderabad Campus, Hyderabad, India Search for more papers by this author Sufiyan Siddiqui , Sufiyan Siddiqui Department of Chemical Engineering, BITS Pilani Hyderabad Campus, Hyderabad, India Search for more papers by this author Inkollu Sreedhar , Corresponding Author Inkollu Sreedhar [email protected] orcid.org/0000-0003-1706-5735 Department of Chemical Engineering, BITS Pilani Hyderabad Campus, Hyderabad, India Correspondence Inkollu Sreedhar, Department of Chemical Engineering, BITS Pilani Hyderabad Campus, Hyderabad 500078, India. Email: [email protected] Search for more papers by this author Rajagopalan Parameshwaran , Rajagopalan Parameshwaran orcid.org/0000-0003-3906-1081 Department of Mechanical Engineering, BITS Pilani Hyderabad Campus, Hyderabad, India Search for more papers by this author Pranshul Bhatnagar , Pranshul Bhatnagar Department of Chemical Engineering, BITS Pilani Hyderabad Campus, Hyderabad, India Search for more papers by this author Sufiyan Siddiqui , Sufiyan Siddiqui Department of Chemical Engineering, BITS Pilani Hyderabad Campus, Hyderabad, India Search for more papers by this author Inkollu Sreedhar , Corresponding Author Inkollu Sreedhar [email protected] orcid.org/0000-0003-1706-5735 Department of Chemical Engineering, BITS Pilani Hyderabad Campus, Hyderabad, India Correspondence Inkollu Sreedhar, Department of Chemical Engineering, BITS Pilani Hyderabad Campus, Hyderabad 500078, India. Email: [email protected] Search for more papers by this author Rajagopalan Parameshwaran , Rajagopalan Parameshwaran orcid.org/0000-0003-3906-1081 Department of Mechanical Engineering, BITS Pilani Hyderabad Campus, Hyderabad, India Search for more papers by this author First published: 25 July 2022 https://doi.org/10.1002/er.8441 Citations: 73 Get it at Duke Funding information: BITS Pilani; Council of Scientific and Industrial Research, India, Grant/Award Number: 22(0783)/19/EMR-II Summary Molten salts as thermal energy storage (TES) materials are gaining the attention of researchers worldwide due to their attributes like low vapor pressure, non-toxic nature, low cost and flexibility, high thermal stability, wide range of applications etc. This review presents potential applications of molten salts in solar and nuclear TES and the factors influencing their performance. Ternary salts (Hitec salt, Hitec XL) are found to be best suited for concentrated solar plants due to their lower melting point and higher efficiency. Two-tank direct energy storage system is found to be more economical due to the inexpensive salts (KCl-MgCl 2 ), while thermoclines are found to be more thermally efficient due to the power cycles involved and the high volumetric heat capacity of the salts involved (LiF-NaF-KF). Heat storage density has been given special focus in this review and methods to increase the same in terms of salt composition changes are discussed in the paper. Methods of concatenating energy storage systems with nuclear power plants are also discussed with different types of nuclear reactors like MHTGR, PAHTR, VHTR, etc. Nanomodifications of molten salts are done to improve heat transfer properties and efficiency of the transfer. The best dopants for such modifications were found to be TiO 2 , SiO 2 , MWCNTs, etc. Future challenges for large scale deployment of molten salts viz., high volume expansion ratio, low thermal conductivity, incongruent melting, corrosion, etc., are listed and discussed. Corrosion of molten salts and its mitigation has been discussed in detail for developing next-generation storage systems and its remedies are also discussed. Abbreviations ARE aircraft reactor experiment CNG compressed natural gas CSP concentrated solar power CSPP concentrated solar power plant DSC differential scanning calorimetry ESD energy storage density ESE energy storage efficiency ESS energy storage systems HTF heat transfer fluid HTR high temperature reactor LATES liquid adsorption thermal energy storage LCOE levelized cost of electricity LF line focusing LHTS latent heat thermal storage LW-SMR light water-small modular reactor MHTGR modular high-temperature gas-cooled reactor MSR molten salt reactor MWCNT multi-walled carbon nanotube NHES nuclear hybrid energy storage NPP nuclear power plant NREL National Renewable Energy Laboratory ORNL Oak Ridge National Laboratory PAHTR prismatic-core advanced high temperature reactor PB-FHR pebble bed fluoride-salt-cooled high temperature reactor PCM phase changing material PF point focusing PTC parabolic trough collector SATES solid adsorption thermal energy storage SHTS sensible heat thermal storage SPT solar power tower SWCNT single-walled carbon nanotube TES thermal energy storage TGA thermal gravimetric analysis TCTS thermocline thermal storage TRISO tri-structural isotropic particle UCO uranium oxycarbide VHTR very high-temperature reactor 1 INTRODUCTION Global increase in population led to increase in energy consumption which in turn led to the environmental degradation. Statistics indicate that energy demand more than doubled in the last decade. This also led to a drastic increase in CO 2 emissions (around 35 billion tonnes as on 2021) causing global warming as power generation is still dependent on fossil fuels. 1 Hence the researchers worldover have focused on alternative sources of energy viz., solar, wind, biomass, geothermal, etc., besides developing novel and sustainable technologies for large scale energy storage. Trends in power consumption are encouraging in terms of shifting toward these renewable sources with lower dependency on fossil fuels though we need to depend on latter for few more decades. The energy emitted by the sun on earth is 4.1 × 10 17 J/h, which exceeds the annual global energy consumption (for the year 2001). 2 Hence, solar energy generated through concentrated solar power plants (CSPPs) is a promising solution to today's energy crisis. However, there often arises an un-co-ordinated mismatch between the energy demand and the energy produced as the alternative energy sources suffer from unpredictable fluctuations viz., variable sunshine period, cloud buffer, uneven wind flow, etc. The potential solution to this problem is development of efficient and sustainable energy storage technologies. Nuclear power plants (NPPs) are an interesting alternative to coal, natural gas, diesel, etc., as they are not only carbon-free but also reliable and economically viable. However, their inability to handle unprecedented load fluctuations and appropriate handling of fuel and generators in the nuclear reactors causing reactivity swings are the drawbacks of this technology. For this reason, energy storage is again required to trap that surplus energy generated during the hours of low demand for using it later when the power demand rises. 3 Therefore, a hybrid system consisting of a heat storage unit and a backup system is being explored along with CSPP or NPP as a sustainable solution to the growing electricity demand. 4 Molten salts are being explored as next generation materials for thermal energy storage (TES) owing to their high heat storage capacities, low vapor pressure, non-toxicity, low cost, high thermal stability, flexibility to modifications, and wide range of application. During off-peak hours, the salts can be heated and stored in an insulated container. 5 Thermal energy can then be converted to electric power using different heat engines. The cooled salt can then be sent to the storage tank again for reheating and continuing the cycle. Historically, heat has been stored in hot and cold water tanks to serve domestic and residential needs. Steam accumulators use the steam released from the NPPs as coolants and store the high-pressure steam as a saturated liquid. 6 The tanks made to store pressurized steam can store the same at high temperatures and are hence found in abundance in multiple parts of Europe and North America despite the potential hazards due to the high expansion coefficient of water resulting in leakages 7 and the closeness of the freezing and boiling points of water giving low operational temperature range. 8 Hybrid systems of solar and NPPs are also reported to be used to achieve higher thermal efficiencies in which solar heat is transmitted to nuclear steam to increase its temperature, and the required continuous heat is delivered via molten salts-based TES systems. The specific objectives of this review are to present: Different molten salts with necessary dopants prominently used as TES materials. Potential applications of molten salts in solar and NPPs. Comparative assessment of various TES technologies. Different configurations of solar and NPPs including hybrid versions. Modification protocols to improve the performance of molten salts using nanomaterials. Corrosion due to molten salts and its mitigation methods. Future challenges and concerns associated with molten salts. This review elaborately encompasses all aspects of molten salts and their usage as heat storage and transfer material for use at solar and NPPs. It starts with a comprehensive yet concise comparative analysis of various TES technologies followed by a discussion on energy storage by phase change materials (PCMs). Popular CSPP designs are presented focusing on their thermodynamic efficiencies and comparison factors. To facilitate heat transfer from one plant location to another, an intense review of heat transfer fluids (HTFs) is done. Furthermore, the motivation to use molten salts arises to store the heat carried by those HTFs, which is successively covered by this review. A wide variety of molten salt mixtures (secondary, tertiary, and even quaternary) are compared based on their thermodynamics and rheological properties like heat capacity, thermal conductivity, viscosity, specific gravity, and range of operating temperatures. These properties are found to be enhanced and thereby storage efficiency by nanoparticle doping. A detailed list of molten salts and their dopants are tabulated in the review. Nuclear TES, different nuclear reactors (MSR, LW-SMR, MHTGR, PAHTR, PB-FHR) used, types of fissile materials and energy storage systems they employ are also discussed in detail. A typical NPP can be inclusively modified to concatenate it with an efficient heat storage technique driven by molten salts. This system is presented elaborately as an nuclear hybrid energy storage (NHES) in this review. The heat storage section of this system uses molten salts in two ways—a two-tank direct design and a thermocline design, both of which are studied and compared based on the relevant parameters. Role of nanofluids to increase the heat storing capabilities of molten salts is discussed. The review finally concludes with the most imminent concerns regarding the usage of such technology at power plants and the future directions. The novelty of this article lies in the comprehensive and inclusive comparison of the many technologies available for TES and their working principles and methods of improving their efficiencies. The more novel hybrid techniques of energy storage are also discussed along with the application of molten salts in them. In order to increase heat storage properties of molten salts, several strategies are provided, and special focus is put on the latest methods associated with nano-modification of molten salts with dopants. A collection of dopants with their characteristics are enlisted and discussed in great depth. A very often over-looked topic of discussion is the problem of corrosion of molten salt storage tanks which is given heavy focus in the last few sections of the paper; their effects, severity, and mitigation strategies are discussed in detail. There has not been any review of molten salts as comprehensive and all-inclusive as this one in a long time. 9 , 10 Furthermore, most studies only consider thermal storage for solar energy, while this review presents energy storage for two alternative energy sources, solar and nuclear energy. 11 - 13 2 THERMAL ENERGY STORAGE TECHNOLOGIES There are two types of TES solutions for CSPPs: active and passive. The system is called an active type when the fluid that moves between the storage tanks is chosen as the storage medium. The system is called direct-active if the storage media also functions as the HTF. In the “indirect-active” type, dissimilar pairs of storage and heat transfer media are used with an additional requirement of a heat exchanger. When a solid is chosen as the storage medium, the HTF only flows through it to charge and discharge the battery. The term “passive” refers to such a type of system. Figure 1 shows various TES designs used at CSPPs. 14 Depending on short-term and long-term variations in solar energy availability and electricity demand, such CSPP-TES-integrated systems adopt a variety of operating strategies 15 : Buffering : A transient mode occupies over steam generators due to cloud cover or some meteorological activities that cause stoppage of optimum solar energy from reaching the collectors. Some HTFs possess just enough thermal inertia to help a plant in managing and working out through such buffer periods, however at a reduced efficiency, as a result of which shut-down of turbines is an unpreventable order. Extension of the delivery period : Peak solar radiation may not coincide with peak power demand. A considerable fraction of the energy accumulated when the solar energy received at its peak is stored and used at a later period of time during greater electricity demand or tariffs. Improving the annual capacity factor : Annual capacity factor is an important measure that compares plant's net electricity production vs the amount of energy it could have produced at its peak efficiency for the entire duration of time. The absence of a storage system lowers its capacity factor significantly. FIGURE 1 Open in figure viewer PowerPoint Types of thermal energy storage design. TES, thermal energy storage As discussed below, TES systems can be classified as sensible heat storage, latent heat storage, and thermochemical storage. 2.1 Sensible Heat Thermal Storage The energy is stored/released in sensible heat thermal storage (SHTS) systems by raising or lowering the storage medium's temperature. The desired thermodynamic and rheological attributes that the medium must possess are high thermal conductivity and heat capacity besides long-term thermal stability. Solid materials (eg, rocks, metals, concrete, bricks, etc.,) can resist extreme temperatures, without",
    "Sufiyan SIDDIQUI | Research Fellow | Bachelor of Engineering | Indian Institute of Science Bangalore, Bengaluru | IISC | Department of Materials Engineering | Research profile Home Indian Institute of Science Bangalore Department of Materials Engineering Sufiyan Siddiqui Sufiyan Siddiqui Bachelor of Engineering Research Fellow at Indian Institute of Science Bangalore Contact Connect with experts in your field Join ResearchGate to contact this researcher and connect with your scientific community. Join for free Log in Contact Connect with experts in your field Join ResearchGate to contact this researcher and connect with your scientific community. Join for free Log in About 5 Publications 1,197 Reads How we measure 'reads' A 'read' is counted each time someone views a publication summary (such as the title, abstract, and list of authors), clicks on a figure, or views or downloads the full-text. Learn more 182 Citations Introduction Interested in polymer nanocomposites applied towards interfacial applications Skills and Expertise Material Characterization Materials Processing Nanomaterials Polymers Coatings Membranes Adsorbents Current institution Indian Institute of Science Bangalore Department of Materials Engineering Bengaluru, India Current position Research Fellow Publications Publications (5) A review on antimicrobial mechanism and applications of graphene-based materials Article Apr 2023 Krishna Shankar Satakshi Agarwal Subham Mishra [...] Iyman Abrar In recent years, graphene and its derivatives, owing to their phenomenal surface, and mechanical, electrical, and chemical properties, have emerged as advantageous materials, especially in terms of their potential for antimicrobial applications. Particularly important among graphene's derivatives is graphene oxide (GO) due to the ease with which it... View Novel pectin-cellulose-biochar composite with SDS modification for copper removal: Optimization, characterization, and regeneration Article Feb 2023 Pranshul Bhatnagar Sadamanti Sireesha Sufiyan Siddiqui Inkollu Sreedhar Many investigations have demonstrated that polymers modified using carbonaceous materials such as biochar, could be effectively employed for heavy metal removal. In this study, pectin, cellulose, and SDS were mixed and modified using cocopeat biochar to synthesise composite beads with increased adsorption capabilities. Through the use of Response S... View Efficient copper removal using low-cost H3PO4 impregnated red-gram biochar-MnO2 nanocomposites Article Dec 2022 Sufiyan Siddiqui Pranshul Bhatnagar Sadamanti Sireesha [...] Inkollu Sreedhar Copper metal removal from wastewater is an essential step to detoxify wastewater before release into human contact. To serve the same purpose, H3PO4 impregnated and KMnO4 functionalised, red-gram seed coat biochar is synthesized, for efficient and economic biosorption of aqueous copper ions. Response Surface Methodology (RSM) is employed to achieve... View Molten salts: Potential candidates for thermal energy Article Jul 2022 Pranshul Bhatnagar Sufiyan Siddiqui Inkollu Sreedhar R. Parameshwaran Molten salts as thermal energy storage (TES) materials are gaining the attention of researchers worldwide due to their attributes like low vapor pressure, non-toxic nature, low cost and flexibility, high thermal stability, wide range of applications etc. This review presents potential applications of molten salts in solar and nuclear TES and the fa... View +1 Wastewater treatment and energy production by microbial fuel cells Article Full-text available Mar 2021 Sufiyan Siddiqui Pranshul Bhatnagar Sahej Dhingra [...] Inkollu Sreedhar The increasing demands of efficient and sustainable energy generation methods from waste products have taken a giant leap in the last century, and especially in the previous two decades. Wastewater treatment has also been a much-researched topic in recent years owing to the exponential increase in effluent-laden wastewater from industries, the agri... View Questions Questions (2) Does pi-pi stacking between CNTs/CNFs and pyrenic species retain itself in hydrothermal reactions? Question Feb 2023 I want to grow Fe3O4 on CNTs/CNFs conjugated with pyrenebutyric acid via pi-pi stacking. This is supposed to be a hydrothermal reaction (takes place at 180°C). Would such temperatures undo the stacking between the pyrene and the CNT/CNF? View 3 Answers How to bind CNT-COOH with CB-NH2? Question Oct 2022 Hi everyone! I want to couple carbon nanotubes (CNTs) with carbon black (CB). The way I have started doing this is by carboxylating CNTs by attaching COOH groups to it and attaching NH 2 groups to CB. Now, I want to know how to combine/bind them together. I'm looking for an amide formation reaction with a certain catalyst and temperature condition. Can someone please help me with what catalyst I can use for this reaction? Any leads would be of great help. Thank you View 3 Answers Network Cited View All Yaroslav Grosu CIC Energigune Korneel Rabaey Ghent University John Regan Pennsylvania State University Falk Harnisch Helmholtz Centre for Environmental Research Miliozzi Adio ENEA Cited By View All Daili Feng University of Science and Technology Beijing Xueming Yang North China Electric Power University Imran Afgan Khalifa University Paul A. Bingham Sheffield Hallam University Weiwei Yang Xi'an Jiaotong University",
    "Molten salts: Potential candidates for thermal energy storage applications - Bhatnagar - 2022 - International Journal of Energy Research - Wiley Online Library",
    "Debirupa MITRA | Professor (Assistant) | Doctor of Philosophy | Birla Institute of Technology and Science - Hyderabad Campus, Hyderabad | BPHC | Department of Chemical Engineering | Research profile Home Birla Institute of Technology and Science - Hyderabad Campus Department of Chemical Engineering Debirupa Mitra Debirupa Mitra Doctor of Philosophy Professor (Assistant) at Birla Institute of Technology and Science - Hyderabad Campus Contact Connect with experts in your field Join ResearchGate to contact this researcher and connect with your scientific community. Join for free Log in Contact Connect with experts in your field Join ResearchGate to contact this researcher and connect with your scientific community. Join for free Log in About 20 Publications 2,303 Reads How we measure 'reads' A 'read' is counted each time someone views a publication summary (such as the title, abstract, and list of authors), clicks on a figure, or views or downloads the full-text. Learn more 741 Citations Introduction Skills and Expertise Material Characterization Materials Biomaterials Material Characteristics SEM Analysis Polymeric Materials Surface Modification Surface Functionalization Surface Characterization Surface Coating Current institution Birla Institute of Technology and Science - Hyderabad Campus Department of Chemical Engineering Hyderabad, India Current position Professor (Assistant) Koon-Gee Neoh's Lab Publications Publications (20) Machine learning-aided screening framework for wound healing peptides Article Oct 2024 Sathish Kumar Gunaseelan Yashi Khandelwal Arnab Dutta [...] Swati Biswas Chronic wounds characterized by prolonged inflammation and persistent infection pose a significant burden to global healthcare systems. Currently, antibiotics and non-steroidal anti-inflammatory drugs (NSAIDs) are administered to patients. Prolonged use of antibiotics is severely discouraged owing to the rapid rise in antimicrobial resistance, and... View Supporting Information.pdf Data Jul 2024 Pranshul Bhatnagar Yashi Khandelwal Shagun Mishra [...] Swati Biswas View Rational design of antimicrobial peptides: An optimization approach Article Jan 2024 Danush Sadasivam Pranav Nambiar Arnab Dutta Debirupa Mitra With increasing concerns over antimicrobial resistance worldwide, antimicrobial peptides (AMPs) can be a potential alternative to conventional antibiotics. Generating new AMPs is challenging as there can be enormous combinations of... View Explainability and extrapolation of machine learning models for predicting the glass transition temperature of polymers Article Dec 2023 Agrim Babbar Sriram Ragunathan Debirupa Mitra [...] Tarak Patra Machine learning (ML) offers promising tools to develop surrogate models for polymers' structure–property relations. Surrogate models can be built upon existing polymer data and are useful for rapidly predicting the properties of unknown polymers. The accuracy of such ML models appears to depend on the feature space representation of polymers, the... View Explainability and Transferability of Machine Learning Models for Predicting the Glass Transition Temperature of Polymers Preprint Full-text available Aug 2023 Agrim Babbar Sriram Ragunathan Debirupa Mitra [...] Tarak Patra Machine learning offers promising tools to develop surrogate models for polymer structure-property relations. Surrogate models can be built upon existing polymer data and are useful for rapidly predicting the properties of unknown polymers. The accuracy of such ML models appears to depend on the feature space representation of polymers, the range o... View Electrochemical Tools for the Prognosis of Skin Wounds Chapter Jun 2023 Ramendra Kishor Pal Debirupa Mitra Arnab Dutta View +4 Combined charge and hydrophobicity-guided screening of antibacterial peptides: two-level approach to predict antibacterial activity and efficacy Article Full-text available May 2023 Ashwin Bale Arnab Dutta Debirupa Mitra Antibacterial peptides can be a potential game changer in the fight against antibiotic resistance. In order for these peptides to become successful antibiotic alternatives, it is essential that they possess high efficacy in addition to just being antibacterial. In this study, we have developed a two-level SVM-based binary classification approach to... View Design of a machine learning-aided screening framework for antibiofilm peptides Article May 2023 Hema Chandra Puchakayala Pranshul Bhatnagar Pranav Nambiar [...] Debirupa Mitra Biofilms are formed by multicellular colonies of microorganisms that are protected by hard extracellular matrices. Eradication of biofilms is a challenging task due to their recalcitrant nature and thus biofilm formation poses a global threat to public health. In this regard, antibiofilm peptides are a promising class of therapeutics that are activ... View Machine learning assisted screening framework for insecticidal peptides Article Jun 2022 Pranav Nambiar Debirupa Mitra Arnab Dutta Pest management in agriculture relies on the use of chemical pesticides. These chemicals are harmful to both the environment and to human health. This has necessitated the search for sustainable alternatives. In this regard, natural products and “biopesticides” are promising for sustainable crop protection. A handful of proteins and peptides with i... View Facile fabrication of porous waste-derived carbon-polyethylene terephthalate composite sorbent for separation of free and emulsified oil from water Article Sep 2021 Debirupa Mitra Ming Hang Tai Ermanda B. Abdullah [...] Koon Gee Neoh Containment of oil spills in aquatic bodies and treatment of oily wastewater are necessary to mitigate oil pollution. Synthetic oil sorbents are commonly used for managing oil spills and while they are effective, their usage introduces a considerable amount of non-biodegradable plastic into the environment. In an effort to develop an inexpensive so... View Polymer-Based Coatings with Integrated Antifouling and Bactericidal Properties for Targeted Biomedical Applications Article Apr 2021 Debirupa Mitra En-Tang Kang Koon Gee Neoh One of the most detrimental consequences of surface colonization by bacteria is healthcare-associated infections (HAIs), which contribute to increased patient mortality and morbidity. Medical devices inserted into the body provide a route for bacterial migration and conducive surfaces for their attachment and proliferation. Antibacterial coatings c... View Adsorptive removal of tetracycline and amoxicillin from aqueous solution by leached carbon black waste and chitosan-carbon composite beads Article Feb 2021 Obaidullah Yaqubi Ming Hang Tai Debirupa Mitra [...] Yves Andres Carbon black waste as waste by-product of oil refineries, exhibits improved specific surface area and is rich in surface functional groups after leaching. In this work, both powdered leached carbon black waste (LCBW) and LCBW-chitosan composite beads prepared via instantaneous gelation method were utilized as adsorbent to study their adsorption cap... View Emerging Pharmaceutical and Organic Contaminants Removal using Carbonaceous Waste from Oil Refineries Article Jan 2021 Debirupa Mitra Changlu Zhou Muhammad Hafiz Bin Hashim [...] Koon Gee Neoh The occurrence of emerging organic contaminants (EOCs) such as chemicals in personal care products, pharmaceuticals, plasticizers, etc. in surface waters is a growing global concern. The discharge of most EOCs are not regulated, and EOCs have been shown to be toxic to both human and aquatic life even at low concentrations. In this work, acid-leache... View Potentiating Anti-cancer Chemotherapeutics and Antimicrobials via Sugar-mediated Strategies Article Mar 2020 Sneha Sree Mullapudi Debirupa Mitra Min Li [...] Koon Gee Neoh The concept of targeted drug delivery evolved from the “magic bullet” idea put forth by Paul Ehrlich more than a century ago, whose original intention was to kill disease-causing microbes without harming the body itself. In this minireview, we highlight sugar-mediated targeted delivery strategies that capitalize on the unique metabolic features of... View Applications and challenges of smart antibacterial coatings Chapter Jan 2020 Debirupa Mitra En-Tang Kang Koon Gee Neoh View Antimicrobial Copper-Based Materials and Coatings: Potential Multifaceted Biomedical Applications Article Dec 2019 Debirupa Mitra En-Tang Kang Koon Gee Neoh Surface contamination by microbes leads to several detrimental consequences like hospital- and device-associated infections. One measure to inhibit surface contamination is to confer the surfaces with antimicrobial properties. Copper's antimicrobial properties have been known since ancient times, and the recent resurgence in exploiting copper for a... View Transparent Copper-Based Antibacterial Coatings with Enhanced Efficacy against Pseudomonas aeruginosa Article Dec 2018 Debirupa Mitra Min Li En-Tang Kang Koon-Gee Neoh Bacterial surface contamination is a major cause of hospital-associated infections. Antibacterial coatings can play an important role in reducing bacteria transmission via inanimate surfaces in healthcare settings. In this work, transparent copper-based antibacterial coatings were fabricated on commercial poly (vinyl fluoride) and stainless steel.... View Transparent Copper-Loaded Chitosan/Silica Antibacterial Coatings with Long-Term Efficacy Article Aug 2017 Debirupa Mitra Min Li En-Tang Kang Koon-Gee Neoh Bacteria-contaminated inanimate surfaces within hospitals and clinics result in transmission of pathogens via direct or indirect contact, leading to increased risk of healthcare-associated infections (HAI). The use of antibacterial coatings is a potential way of reducing the bacterial burden, but many surfaces like instrument panels and monitors ne... View Thiol-Ol Chemistry for Grafting of Natural Polymers to Form Highly Stable and Efficacious Antibacterial Coatings Article Dec 2016 Min Li Debirupa Mitra En-Tang Kang [...] Koon Gee Neoh Bacterial contamination of surfaces and the associated risk of infection is a significant threat to human health. Some natural antibacterial polymers with low toxicity are promising coating materials for alleviating pathogenic colonization on surfaces. However, widespread application of these polymers as antibacterial coatings is constrained by coa... View Scalable Aqueous-Based Process for Coating Polymer and Metal Substrates with Stable Quaternized Chitosan Antibacterial Coatings Article Aug 2016 Debirupa Mitra Min Li Rong Wang [...] Koon Gee Neoh View Network Cited View All Raymond J. Turner University of Calgary Michael G Schmidt Medical University of South Carolina Christophe Espírito Santo CATAA - Centro de Apoio Tecnológico Agro Alimentar Gregor Grass Bundeswehr Institute of Microbiology Peng Li Northwestern Polytechnical University Cited By View All Mohammad Ashfaq Woxsen University Ravin Narain University of Alberta Neetu Talreja Alliance University Pinar tatar guner Koc University Divya Chauhan University of South Florida",
    "Error fetching content: 403 Client Error: Forbidden for url: https://pubs.acs.org/doi/abs/10.1021/acsbiomaterials.6b00812",
    "Error fetching content: 403 Client Error: Forbidden for url: https://www.researchgate.net/figure/An-MFC-PEC-hybrid-system-with-photon-illumination-on-the-anode-and-TiO2-nanowire-as_fig3_350080213"
  ],
  "links": [
    "https://www.linkedin.com/in/pranshul-bhatnagar",
    "https://datascience.duke.edu/people/8906/",
    "https://www.sciencedirect.com/science/article/abs/pii/S1359511324002137",
    "https://datascience.duke.edu/people/",
    "https://onlinelibrary.wiley.com/doi/abs/10.1002/er.8441",
    "https://www.researchgate.net/profile/Sufiyan-Siddiqui",
    "https://onlinelibrary.wiley.com/doi/pdf/10.1002/er.8441",
    "https://www.researchgate.net/profile/Debirupa-Mitra",
    "https://pubs.acs.org/doi/abs/10.1021/acsbiomaterials.6b00812",
    "https://www.researchgate.net/figure/An-MFC-PEC-hybrid-system-with-photon-illumination-on-the-anode-and-TiO2-nanowire-as_fig3_350080213"
  ]
}