{
  "query": "Bill Gates",
  "rendered_query": "\"Bill Gates\"",
  "total_results": 10,
  "texts": [
    "Bill Gates. Bill Gates in 2025. Gates in 2025. Born. William Henry Gates III. (1955-10-28) October 28, 1955 (age 70). Seattle, Washington, United States.",
    "On Bill Gates's website he writes about the people he meets, the books he's reading, and what he's learning and working on. Come join the conversation!",
    "Bill Gates (@BillGates) - Posts - Sharing things I'm learning through my foundation work and other interests. | X (formerly Twitter)",
    "Photo shared by Bill Gates on September 26, 2025 tagging @gatesfoundation. May be ...",
    "Bill Gates is an influencer. Chair, Gates Foundation and Founder, Breakthrough Energy. Gates Foundation Harvard University. Seattle, Washington ...",
    "Feb 11, 2013 ... I'm Bill Gates, co-chair of the Bill & Melinda Gates Foundation. Ask me anything. Many of you know me from my Microsoft days. The company remains very ...",
    "Your browser can't play this video. Learn more. Bill Gates. Home. Shorts. Library. Bill Gates. @billgates. 3.23M subscribers•760 videos. Hi, I'm Bill Gates.",
    "Bill Gates, Steve Cook, and Signe Ostby join a collaborative initiative that will help expand economic opportunity for low-income Americans. Impact investing, ...",
    "Jan 29, 2017 ... In January 1996, Bill Gates wrote the following essay titled “Content is King”, which was published on the Microsoft website. “Content is where ...",
    "As chair of the Gates Foundation, Bill Gates shapes and approves strategies, advocates for the foundation's issues, and sets the organization's direction."
  ],
  "links": [
    "https://en.wikipedia.org/wiki/Bill_Gates",
    "https://www.gatesnotes.com/",
    "https://x.com/BillGates",
    "https://www.instagram.com/thisisbillgates/?hl=en",
    "https://www.linkedin.com/in/williamhgates",
    "https://www.reddit.com/r/IAmA/comments/18bhme/im_bill_gates_cochair_of_the_bill_melinda_gates/",
    "https://www.youtube.com/billgates",
    "https://www.givingpledge.org/pledger/bill-gates/",
    "https://medium.com/@HeathEvans/content-is-king-essay-by-bill-gates-1996-df74552f80d9",
    "https://www.gatesfoundation.org/about/leadership/bill-gates"
  ]
}