{
  "query": "Daymond John",
  "rendered_query": "\"Daymond John\"",
  "total_results": 10,
  "texts": [
    "He is the founder, president, and chief executive officer of FUBU, and is the founder of The Shark Group. Daymond John. John in 2023. Born. Daymond Garfield ...",
    "Daymond John shares the philosophy and practices that help him to be successful in business and life. Book Daymond John today to speak at your next event.",
    "Daymond John (@thesharkdaymond) • Instagram photos and videos.",
    "Daymond John. 897015 likes · 10422 talking about this. CEO of FUBU, CEO of The Shark Group, Co-Star on ABC's Shark Tank, U.S. Presidential Ambassador...",
    "Daymond John is an influencer. CEO of FUBU and The Shark Group, TV Personality on ABC Shark Tank, Public Speaker. ABC Television FUBU Foundation ...",
    "Daymond John (@thesharkdaymond) on TikTok | 4.3M Likes. 291.6K Followers. The People's Shark .Watch Daymond John's popular videos: \"MY BIOHACKING BROKE .",
    "Jan 22, 2018 ... I'm Daymond John, co-star on ABC's Shark Tank, Founder and CEO of the fashion brand FUBU, author of NYT Best Seller The Power of Broke and my newest book, Rise ...",
    "Daymond John, Entrepreneur. By Sue Glader. These days, Daymond John might be best known as one of the five savvy business executives (known as the ...",
    "Dec 21, 2015 ... 3 day weekend seminar that Daymond John will actually be at, but guess what? It costs $4000. Keep in mind that this was a week before Christmas.",
    "Feb 5, 2018 ... On this episode of the School of Greatness we are joined by Shark Tank's Daymond John to discuss his newest book Rise and Grind, ..."
  ],
  "links": [
    "https://en.wikipedia.org/wiki/Daymond_John",
    "https://daymondjohn.com/",
    "https://www.instagram.com/thesharkdaymond/?hl=en",
    "https://www.facebook.com/TheSharkDaymond/",
    "https://www.linkedin.com/in/daymondjohn",
    "https://www.tiktok.com/@thesharkdaymond?lang=en",
    "https://www.reddit.com/r/IAmA/comments/7s8wup/im_entrepreneur_daymond_john_im_a_shark_on_abcs/",
    "https://dyslexia.yale.edu/story/daymond-john/",
    "https://www.reddit.com/r/Entrepreneur/comments/3xr3oa/my_review_of_daymond_johns_launch_academy_ugh/",
    "https://lewishowes.com/podcast/e-daymond-john-rise-grind-habits-successful-business-life/"
  ]
}