{
  "query": "Kevin O'Leary",
  "rendered_query": "\"Kevin O'Leary\"",
  "total_results": 10,
  "texts": [
    "Terrence Thomas Kevin O'Leary (born July 9, 1954), also known as Mr. Wonderful, is a Canadian businessman and television personality. From 2004 to 2014, ...",
    "Passionate about startups, Kevin O'Leary is always looking for the next amazing business proposal with the potential to make it big.",
    "1 day ago ... Kevin O'Leary aka Mr. Wonderful (@kevinolearytv) - Posts - Chairman of O'Leary Ventures and Beanstox, 5 X Emmy Shark Tank's Mr. Wonderful, ...",
    "Photo by Kevin O'Leary in Harvard Business School with @a24. May be. Well, needless to say I'm honored. Thank you @a24 !",
    "... 't play this video. Learn more. Kevin O'Leary. Home. Shorts. Library. Kevin O'Leary. @kevinoleary. 1.11M subscribers•1.5K videos. Watch me, Kevin O'Leary ...",
    "Kevin O'Leary's success story starts where most entrepreneurs begin: with a big idea and zero cash. From his basement, he launched SoftKey Software Products.",
    "Kevin O'Leary. Producer: Shark Tank. Kevin O'Leary is a Canadian businessman, investor, journalist, writer, financial commentator and television personality ...",
    "Get to know Kevin O'Leary from Shark Tank. Read the official ABC bio, show quotes and learn about the role at ABC TV.",
    "Mar 22, 2018 ... \"Shark Tank\" investor Kevin O'Leary explains why companies in his portfolio with the highest returns are women-run businesses.",
    "Kevin O'Leary. 816562 likes · 51018 talking about this. Chairman of O'Leary Ventures and Beanstox. This is my official facebook page."
  ],
  "links": [
    "https://en.wikipedia.org/wiki/Kevin_O%27Leary",
    "https://kevinoleary.com/",
    "https://x.com/kevinolearytv",
    "https://www.instagram.com/kevinolearytv/?hl=en",
    "https://www.youtube.com/channel/UC1dKnMpbZ-XDp_OhcSWoXoA",
    "https://www.linkedin.com/in/kevinolearytv",
    "https://www.imdb.com/name/nm2891968/",
    "https://abc.com/cast/683912da-1a73-47d9-9e0d-abed4028030a",
    "https://www.cnbc.com/2018/03/22/shark-tanks-kevin-oleary-women-make-me-the-most-money.html",
    "https://www.facebook.com/kevinolearytv/"
  ]
}