{
  "query": "Mark Cuban",
  "rendered_query": "\"Mark Cuban\"",
  "total_results": 10,
  "texts": [
    "Mark Cuban (born July 31, 1958) is an American businessman and television personality. He is the former principal owner and current minority owner of the ...",
    "NBA franchise based in Dallas, Texas and 2011 NBA Champion. Dallas Mavericks. Mark Cuban cost plus drug company blue logo.",
    "May 11, 2025 ... Mark Cuban (@mcuban) - Posts - Dunking on the pharma industry with @costplusdrugs .com, the lowest prices on meds anywhere. check .",
    "The Indiana University Sport Business Conference is proud to announce this year's Keynote Speaker: Mark Cuban. Get your tickets now to hear from Mark and other ...",
    "Mark Cuban is an influencer, President, Indiana University Bloomington. About: I'm an entrepreneur, markcuban.com.",
    "Dec 24, 2012 ... Mark Cuban, this is my AMA. ask me anything, im ready to go. Archived post. New comments cannot be posted and votes cannot be cast. Upvote 2.3K",
    "Mark Cuban. 1414181 likes · 442 talking about this. Entrepreneur. Disrupting Healthcare at Costplusdrugs.com, Investor: MarkCuban.com @mcuban on all...",
    "Mark Cuban founded video portal Broadcast.com with fellow Indiana University alum Todd Wagner in 1995 and sold it to Yahoo for $5.7 billion in 1999.",
    "Feb 7, 2017 ... Mark Cuban on Why You Need to Study Artificial Intelligence or You'll be a Dinosaur in 3 Years Mark Cuban opened the Upfront Summit in an ...",
    "Mar 23, 2014 ... Mark Cuban, the outspoken Dallas Mavericks owner, predicts a drastic decline in the popularity of the NFL over the next decade due to the ..."
  ],
  "links": [
    "https://en.wikipedia.org/wiki/Mark_Cuban",
    "https://markcubancompanies.com/",
    "https://x.com/mcuban?lang=en",
    "https://www.instagram.com/mcuban/?hl=en",
    "https://www.linkedin.com/in/mark-cuban-06a0755b",
    "https://www.reddit.com/r/IAmA/comments/15doqt/mark_cuban_this_is_my_ama/",
    "https://www.facebook.com/markcuban/",
    "https://www.forbes.com/profile/mark-cuban/",
    "https://bothsidesofthetable.com/mark-cuban-on-why-you-need-to-study-artificial-intelligence-or-youll-be-a-dinosaur-in-3-years-db3447bea1b4",
    "https://www.espn.com/dallas/nba/story/_/id/10662203/dallas-mavericks-owner-mark-cuban-says-greedy-nfl-10-years-away-implosion"
  ]
}