{
  "query": "Paul Varga",
  "rendered_query": "\"Paul Varga\"",
  "total_results": 10,
  "texts": [
    "Paul Varga. Solid Waste and Recycling Title: Communications Manager Phone: 301-600-7405 · Paul Varga · Return to Staff Directory. Visit Frederick · Bids & RFPs.",
    "Paul Varga is Venture Partner at Calm/Storm. Calm/Storm is an exclusive founder network and venture capital firm. We invest in purpose driven founders ...",
    "Paul Varga. President at Varga Tax Service, LLC. Varga Tax Service, LLC Texas A&M University. Southlake, Texas, United States. 232 followers 228 ...",
    "Oct 8, 2025 ... PAUL VARGA, OFM CONV. 1936-2025. Fr. Paul (Stephen) Varga, OFM Conv., a Franciscan Friar of ...",
    "Plus they played Joe's Head for the first time in 15 years, my favorite song.. thankyou @johnnyv109 @pekiss.bakery and @konrad_kiss. Photo by Paul Varga in ...",
    "Paul Varga. Paul C. Varga Headshot. Back to Directory. Education Information: BBA, Finance '85. Paul C. Varga is CEO of Brown-Forman Corporation, which for 150 ...",
    "May 29, 2018 ... Brown–Forman Announces Leadership Succession Plan. Paul Varga to Retire; Lawson Whiting Named Incoming CEO as of January 1, 2019. Louisville ...",
    "Paul Varga Obituary. Cherished husband of Anna Marie (nee Zoretich). Loving father of Tonya Hovanec (Dave) and Paul Jr. (Rebecca). Dearest grandfather.",
    "Paul Varga, the former Chairman and CEO of Brown-Forman, the largest distilling company in the world with brands like Jack Daniels and Woodford Reserve.",
    "Paul Varga. #VowsWithTheVargas. August 2, 2025. Kutztown, PA. RSVP. Our Story. Like the stereotypical millennials that they are, Kirsten and Paul met on Hinge ( ..."
  ],
  "links": [
    "https://frederickcountymd.gov/directory.aspx?EID=1898",
    "https://www.calmstorm.vc/team/paul-varga",
    "https://www.linkedin.com/in/paul-varga-6ab6b646",
    "https://stpetersbytheshore.org/news/in-memory-of-fr-paul-varga-ofm-conv",
    "https://www.instagram.com/paulanthonyvarga/",
    "https://gatton.uky.edu/people/paul-varga",
    "https://www.brown-forman.com/article/brown-forman-announces-leadership-succession-plan-may-29-2018",
    "https://obits.cleveland.com/us/obituaries/cleveland/name/paul-varga-obituary?id=17929187",
    "https://howleaderslead.com/leaders/59/Paul-Varga",
    "https://www.zola.com/wedding/paulandkirsten2025"
  ]
}