{
  "query": "Peter Thiel",
  "rendered_query": "\"Peter Thiel\"",
  "total_results": 10,
  "texts": [
    "For the German Olympic skier, see Peter Thiel (cross-country skier). For the Danish philosopher, author and publisher, see Peter Thielst. Peter Andreas Thiel (/ ...",
    "Real Time Net Worth · PayPal cofounder Peter Thiel remains a general partner of venture capital firm Founders Fund, where he is involved in firm strategy and ...",
    "Apr 13, 2009 ... Peter Thiel shares the belief that politics is mostly futile, a conclusion he reached after years of activism. In particular, he believes that ...",
    "Oct 11, 2025 ... Inside tech billionaire Peter Thiel's off-the-record lectures about the antichrist. The political svengali and investor has been giving lectures ...",
    "Peter Thiel is an entrepreneur and investor. He cofounded PayPal, led it as CEO, and took it public; he made the first outside investment in Facebook.",
    "Peter Thiel. The Founders Fund Stanford University. San Francisco, California, United States. 88K followers 114 connections. See your mutual ...",
    "Jun 26, 2025 ... My guest today is a co-founder of PayPal and Palantir, and an early investor in the political careers of Donald Trump and JD Vance. Peter Thiel ...",
    "Apr 6, 2015 ... Peter Thiel talks with Tyler Cowen about stagnation, the Bible, company names, chess, favorite TV shows, and even the “Straussian Christ.”",
    "Sep 8, 2014 ... Peter Thiel (@peterthiel) - Posts - Technology entrepreneur, investor, philanthropist. | X (formerly Twitter)",
    "Sep 9, 2014 ... \"Freedom lies in being bold.\" — Robert Frost This episode's guest is the incredible Peter Thiel. Peter is a serial company founder (PayPal, ..."
  ],
  "links": [
    "https://en.wikipedia.org/wiki/Peter_Thiel",
    "https://www.forbes.com/profile/peter-thiel/",
    "https://www.cato-unbound.org/2009/04/13/peter-thiel/education-libertarian",
    "https://www.theguardian.com/us-news/2025/oct/10/peter-thiel-lectures-antichrist",
    "https://foundersfund.com/team/peter-thiel/",
    "https://www.linkedin.com/in/peterthiel",
    "https://www.nytimes.com/2025/06/26/opinion/peter-thiel-antichrist-ross-douthat.html",
    "https://conversationswithtyler.com/episodes/peter-thiel/",
    "https://x.com/peterthiel",
    "https://tim.blog/2014/09/09/peter-thiel/"
  ]
}